src/02_tech/manjaro_setup.org
#+LATEX_HEADER: \newenvironment{lequation}{\begin{equation}\Large}{\end{equation}}
#+OPTIONS: ^:nil
#+ATTR_LATEX: :width 5cm :options angle=90
#+TITLE: [MIGRATE]Majaro配置
#+AUTHOR: 杨 睿
#+EMAIL: yangruipis@163.com
#+KEYWORDS: 
#+OPTIONS: H:4 toc:t
#+OPTIONS: tex:t
#+SETUPFILE: https://gitee.com/yangruigit/my_blogs/raw/master/lib/theme-readtheorg.setup
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+html: <div align="right">
#+html: <a href="javascript:history.back()">返回</a>
#+html: </div>

* ss并且开机启动

** 安装shadowsocks

#+BEGIN_SRC
sudo pip install shadowsocks 
#+END_SRC

** 建立配置文件ss.json

我的位置是： ~/home/ray/Documents/shadowsocks/ss.json~
#+BEGIN_SRC python
{
    "server":"*.*.*.*",
    "server_port":***,
    "local_port":1081,
    "password":"*****",
    "timeout":600,
    "method":"aes-256-cfb"
}
#+END_SRC

** 建立sh文件，用以运行

我的位置是： ~/home/ray/Documents/shadowsocks/ss.sh~

#+BEGIN_SRC bash
#!/bin/bash
#ss.sh
/home/ray/anaconda3/bin/sslocal -c /home/ray/Documents/shadowsocks/ss.json 

echo "connected!"
#+END_SRC
**注意** ，如果是开机启动会出现:"sslocal 未知的命令"的情况，一定要附上绝对路径，或者加入环境变量。

不要忘记增加可执行权限：

#+BEGIN_SRC bash
sudo chmod +x ss.sh
#+END_SRC

测试：打开终端后，运行: sh /home/ray/Documents/shadowsocks/ss.sh，不报错就成功了

** 开机自动启动

*** 首先载启动文件`/etc/rc.local`中加入 

#+BEGIN_SRC bash
sh /home/ray/Documents/shadowsocks/ss.sh
#+END_SRC

增加权限：
#+BEGIN_SRC bash
sudo chmod +x /etc/rc.local
#+END_SRC
重启，如果可以翻墙最好，如果不行则考虑步骤3.2

*** 3.2 添加服务
新建文件：`/usr/lib/systemd/system/rc-local.service`，在其中加入：
#+BEGIN_SRC bash
[Unit]
Description=/etc/rc.local Compatibility
ConditionPathExists=/etc/rc.local
[Service]
ExecStart=/etc/rc.local
[Install]
WantedBy=multi-user.target
#+END_SRC

之后在终端运行：
#+BEGIN_SRC bash
systemctl enable rc-local.service    # 允许该服务，使其可以开机自运行
systemctl start rc-local.service    # 启动该服务
systemctl status rc-local.service   # 查看服务状态
#+END_SRC
如果发现服务状态没有异常，则搞定了，重启即可

** github代理

#+BEGIN_SRC bash
git config --global http.proxy 'socks5://127.0.0.1:1081' 
#+END_SRC
1081为本地端口号

* 双硬盘时，机械硬盘挂载

** 格式化硬盘为EXT4
如果时windows过来的NTFS，一定要进行格式化，否则无法写入

#+BEGIN_SRC bash
fdisk -l   # 列出所有分区，找到想要格式化的分区名，如/dev/sda1
sudo mkfs -t ext4 /dev/sda1   # 格式化完成
#+END_SRC

** 分区
#+BEGIN_SRC bash
sudo fdisk /dev/sda     #格式化后名称为/dev/sda
#+END_SRC
输入n、p、1、两下回车、wq、回车，分成一个区

** 挂载
#+BEGIN_SRC bash
# 新建文件夹作为挂载点
mkdir /home/ray/Documents/Data

# 给定写入权限
chown -R 500:ray /run/media/ray/data/
sudo chown ray:ray /run/media/ray/data/

# 挂载
sudo mount -t ext4 /dev/sda1 /home/ray/Documents/Data/
#+END_SRC

** 开机自动挂载
#+BEGIN_SRC bash
sudo gedit /etc/fstab
#+END_SRC

加入：
#+END_SRC
/dev/sda1 /home/ray/Documents/Data ext4 defaults 0 2 
#+END_SRC

* 添加字体
** 安装依赖
#+BEGIN_SRC bash
sudo pacman -S fontconfig
#+END_SRC

** 下载对应的字体文件，并且放到指定位置
- 微软雅黑：https://pan.baidu.com/s/1pL5asEv 
- 放入/usr/share/fonts/my_fonts/中

** 建立缓存 

mkfontscale 
mkfontdir 
fc-cache -fv

