src/02_tools/manjaro_setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-30 Fri 10:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>[MIGRATE]Majaro配置</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="杨 睿" />
<link rel="stylesheet" type="text/css" href="https://yangruigit.gitee.io/my_blogs/lib/themes/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://yangruigit.gitee.io/my_blogs/lib/themes/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">[MIGRATE]Majaro配置</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org796bd28">1. ss并且开机启动</a>
<ul>
<li><a href="#org7a64520">1.1. 安装shadowsocks</a></li>
<li><a href="#org4e0888c">1.2. 建立配置文件ss.json</a></li>
<li><a href="#org19d13a4">1.3. 建立sh文件，用以运行</a></li>
<li><a href="#org7c40525">1.4. 开机自动启动</a>
<ul>
<li><a href="#org3906bd4">1.4.1. 首先载启动文件`/etc/rc.local`中加入</a></li>
<li><a href="#org9ba4aee">1.4.2. 3.2 添加服务</a></li>
</ul>
</li>
<li><a href="#org4c618ea">1.5. github代理</a></li>
</ul>
</li>
<li><a href="#org2762430">2. 双硬盘时，机械硬盘挂载</a>
<ul>
<li><a href="#orgf559857">2.1. 格式化硬盘为EXT4</a></li>
<li><a href="#org64ce24a">2.2. 分区</a></li>
<li><a href="#org8657842">2.3. 挂载</a></li>
<li><a href="#org046aa97">2.4. 开机自动挂载</a></li>
</ul>
</li>
<li><a href="#org1f68c3d">3. 添加字体</a>
<ul>
<li><a href="#org5dd2320">3.1. 安装依赖</a></li>
<li><a href="#org9292b88">3.2. 下载对应的字体文件，并且放到指定位置</a></li>
<li><a href="#org6929754">3.3. 建立缓存</a></li>
</ul>
</li>
<li><a href="#orgfe2cb6f">4. 安装 latex</a></li>
<li><a href="#orgee3be24">5. 双显卡驱动</a>
<ul>
<li><a href="#org39011de">5.1. 安装</a></li>
<li><a href="#org6f50bcf">5.2. 防止启动后无法进入图形界面</a></li>
<li><a href="#orgcc8f25e">5.3. 测试</a></li>
<li><a href="#orgfaedf24">5.4. 两种用法</a></li>
</ul>
</li>
<li><a href="#org5028fab">6. docker + pyspark + jupyter 安装</a>
<ul>
<li><a href="#org21da67a">6.1. 本地安装docker</a>
<ul>
<li><a href="#orga64865d">6.1.1. 1.1 安装docker包</a></li>
<li><a href="#orga6c7766">6.1.2. 1.2 防止权限问题，加入用户权限</a></li>
<li><a href="#orgb7e1582">6.1.3. 1.3 重启服务（或者重启计算机）</a></li>
<li><a href="#org88098c6">6.1.4. 1.4 查看安装是否成功</a></li>
</ul>
</li>
<li><a href="#org3ab4ff1">6.2. 配置spark 镜像(images)和容器(containers)</a>
<ul>
<li><a href="#orgcf272e0">6.2.1. 首先，直接建立容器，如果镜像不存在，则会自动下载：</a></li>
<li><a href="#org0baa8e8">6.2.2. 其次，查看docker状态</a></li>
<li><a href="#org340cf1c">6.2.3. 最后，直接打开或是关闭</a></li>
</ul>
</li>
<li><a href="#orgbf5f64d">6.3. 3 推荐的pyspark docker</a></li>
<li><a href="#orga9e2cdc">6.4. 1. 安装zsh</a></li>
<li><a href="#orgfd7f351">6.5. 2. 安装 oh-my-zsh</a></li>
<li><a href="#orgdac9cdc">6.6. 3. 设置为默认shell</a></li>
<li><a href="#org4fc0a64">6.7. 4. 添加powerline</a></li>
</ul>
</li>
<li><a href="#org92301fd">7. tensorflow 环境搭建</a>
<ul>
<li><a href="#org42a9d2d">7.1. 1. 双显卡切换为独显</a></li>
<li><a href="#org8daf68b">7.2. 2. 安装CUDA</a>
<ul>
<li><a href="#org6382e70">7.2.1. 2.1 yaourt 安装</a></li>
<li><a href="#orgbb131fd">7.2.2. 2.2 加入环境变量</a></li>
<li><a href="#org01d73a9">7.2.3. 2.3 验证安装</a></li>
</ul>
</li>
<li><a href="#org4b9c279">7.3. 3. cuDNN安装</a></li>
<li><a href="#org37b1d6f">7.4. 4. 安装tensorflow-gpu版本</a></li>
<li><a href="#org903e04c">7.5. 5. 安装keras</a></li>
</ul>
</li>
<li><a href="#org90f2f75">8. linux备份</a>
<ul>
<li><a href="#org85c1517">8.1. 0. 权限问题</a></li>
<li><a href="#orgd6fe3cc">8.2. 1. 备份</a></li>
<li><a href="#orga28f37f">8.3. 2. 恢复</a></li>
</ul>
</li>
<li><a href="#org94e93b9">9. 连接鼠标</a>
<ul>
<li><a href="#orgc34fc55">9.1. 1. 蓝牙直连</a></li>
<li><a href="#orgcc4d278">9.2. 2. 有线连接，安装驱动</a></li>
<li><a href="#orgeac5acf">9.3. 每次打开终端时互换</a></li>
<li><a href="#orgdcce190">9.4. 服务器端：</a></li>
<li><a href="#org3fce96c">9.5. 本地端</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div align="right">
<a href="javascript:history.back()">返回</a>
</div>

<div id="outline-container-org796bd28" class="outline-2">
<h2 id="org796bd28"><span class="section-number-2">1</span> ss并且开机启动</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7a64520" class="outline-3">
<h3 id="org7a64520"><span class="section-number-3">1.1</span> 安装shadowsocks</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
sudo pip install shadowsocks 
</pre>
</div>
</div>

<div id="outline-container-org4e0888c" class="outline-3">
<h3 id="org4e0888c"><span class="section-number-3">1.2</span> 建立配置文件ss.json</h3>
<div class="outline-text-3" id="text-1-2">
<p>
我的位置是： <code>/home/ray/Documents/shadowsocks/ss.json</code>
</p>
<div class="org-src-container">
<pre class="src src-python">{
    <span class="org-string">"server"</span>:<span class="org-string">"*.*.*.*"</span>,
    <span class="org-string">"server_port"</span>:***,
    <span class="org-string">"local_port"</span>:1081,
    <span class="org-string">"password"</span>:<span class="org-string">"*****"</span>,
    <span class="org-string">"timeout"</span>:600,
    <span class="org-string">"method"</span>:<span class="org-string">"aes-256-cfb"</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org19d13a4" class="outline-3">
<h3 id="org19d13a4"><span class="section-number-3">1.3</span> 建立sh文件，用以运行</h3>
<div class="outline-text-3" id="text-1-3">
<p>
我的位置是： <code>/home/ray/Documents/shadowsocks/ss.sh</code>
</p>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/</span><span class="org-keyword">bash</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">ss.sh</span>
/home/ray/anaconda3/bin/sslocal -c /home/ray/Documents/shadowsocks/ss.json 

<span class="org-builtin">echo</span> <span class="org-string">"connected!"</span>
</pre>
</div>
<p>
<b><b>注意</b></b> ，如果是开机启动会出现:"sslocal 未知的命令"的情况，一定要附上绝对路径，或者加入环境变量。
</p>

<p>
不要忘记增加可执行权限：
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo chmod +x ss.sh
</pre>
</div>

<p>
测试：打开终端后，运行: sh /home/ray/Documents/shadowsocks/ss.sh，不报错就成功了
</p>
</div>
</div>

<div id="outline-container-org7c40525" class="outline-3">
<h3 id="org7c40525"><span class="section-number-3">1.4</span> 开机自动启动</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org3906bd4" class="outline-4">
<h4 id="org3906bd4"><span class="section-number-4">1.4.1</span> 首先载启动文件`/etc/rc.local`中加入</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<pre class="src src-bash">sh /home/ray/Documents/shadowsocks/ss.sh
</pre>
</div>

<p>
增加权限：
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo chmod +x /etc/rc.local
</pre>
</div>
<p>
重启，如果可以翻墙最好，如果不行则考虑步骤3.2
</p>
</div>
</div>

<div id="outline-container-org9ba4aee" class="outline-4">
<h4 id="org9ba4aee"><span class="section-number-4">1.4.2</span> 3.2 添加服务</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
新建文件：`/usr/lib/systemd/system/rc-local.service`，在其中加入：
</p>
<div class="org-src-container">
<pre class="src src-bash">[Unit]
<span class="org-variable-name">Description</span>=/etc/rc.local Compatibility
<span class="org-variable-name">ConditionPathExists</span>=/etc/rc.local
[Service]
<span class="org-variable-name">ExecStart</span>=/etc/rc.local
[Install]
<span class="org-variable-name">WantedBy</span>=multi-user.target
</pre>
</div>

<p>
之后在终端运行：
</p>
<div class="org-src-container">
<pre class="src src-bash">systemctl enable rc-local.service    <span class="org-comment-delimiter"># </span><span class="org-comment">&#20801;&#35768;&#35813;&#26381;&#21153;&#65292;&#20351;&#20854;&#21487;&#20197;&#24320;&#26426;&#33258;&#36816;&#34892;</span>
systemctl start rc-local.service    <span class="org-comment-delimiter"># </span><span class="org-comment">&#21551;&#21160;&#35813;&#26381;&#21153;</span>
systemctl status rc-local.service   <span class="org-comment-delimiter"># </span><span class="org-comment">&#26597;&#30475;&#26381;&#21153;&#29366;&#24577;</span>
</pre>
</div>
<p>
如果发现服务状态没有异常，则搞定了，重启即可
</p>
</div>
</div>
</div>

<div id="outline-container-org4c618ea" class="outline-3">
<h3 id="org4c618ea"><span class="section-number-3">1.5</span> github代理</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-bash">git config --global http.proxy <span class="org-string">'socks5://127.0.0.1:1081'</span> 
</pre>
</div>
<p>
1081为本地端口号
</p>
</div>
</div>
</div>

<div id="outline-container-org2762430" class="outline-2">
<h2 id="org2762430"><span class="section-number-2">2</span> 双硬盘时，机械硬盘挂载</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf559857" class="outline-3">
<h3 id="orgf559857"><span class="section-number-3">2.1</span> 格式化硬盘为EXT4</h3>
<div class="outline-text-3" id="text-2-1">
<p>
如果时windows过来的NTFS，一定要进行格式化，否则无法写入
</p>

<div class="org-src-container">
<pre class="src src-bash">fdisk -l   <span class="org-comment-delimiter"># </span><span class="org-comment">&#21015;&#20986;&#25152;&#26377;&#20998;&#21306;&#65292;&#25214;&#21040;&#24819;&#35201;&#26684;&#24335;&#21270;&#30340;&#20998;&#21306;&#21517;&#65292;&#22914;/dev/sda1</span>
sudo mkfs -t ext4 /dev/sda1   <span class="org-comment-delimiter"># </span><span class="org-comment">&#26684;&#24335;&#21270;&#23436;&#25104;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org64ce24a" class="outline-3">
<h3 id="org64ce24a"><span class="section-number-3">2.2</span> 分区</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-bash">sudo fdisk /dev/sda     <span class="org-comment-delimiter">#</span><span class="org-comment">&#26684;&#24335;&#21270;&#21518;&#21517;&#31216;&#20026;/dev/sda</span>
</pre>
</div>
<p>
输入n、p、1、两下回车、wq、回车，分成一个区
</p>
</div>
</div>

<div id="outline-container-org8657842" class="outline-3">
<h3 id="org8657842"><span class="section-number-3">2.3</span> 挂载</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">&#26032;&#24314;&#25991;&#20214;&#22841;&#20316;&#20026;&#25346;&#36733;&#28857;</span>
mkdir /home/ray/Documents/Data

<span class="org-comment-delimiter"># </span><span class="org-comment">&#32473;&#23450;&#20889;&#20837;&#26435;&#38480;</span>
chown -R 500:ray /run/media/ray/data/
sudo chown ray:ray /run/media/ray/data/

<span class="org-comment-delimiter"># </span><span class="org-comment">&#25346;&#36733;</span>
sudo mount -t ext4 /dev/sda1 /home/ray/Documents/Data/
</pre>
</div>
</div>
</div>

<div id="outline-container-org046aa97" class="outline-3">
<h3 id="org046aa97"><span class="section-number-3">2.4</span> 开机自动挂载</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-bash">sudo gedit /etc/fstab
</pre>
</div>

<p>
加入：
#+END_SRC
/dev/sda1 /home/ray/Documents/Data ext4 defaults 0 2 
#+END_SRC
</p>
</div>
</div>
</div>

<div id="outline-container-org1f68c3d" class="outline-2">
<h2 id="org1f68c3d"><span class="section-number-2">3</span> 添加字体</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5dd2320" class="outline-3">
<h3 id="org5dd2320"><span class="section-number-3">3.1</span> 安装依赖</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-bash">sudo pacman -S fontconfig
</pre>
</div>
</div>
</div>

<div id="outline-container-org9292b88" class="outline-3">
<h3 id="org9292b88"><span class="section-number-3">3.2</span> 下载对应的字体文件，并且放到指定位置</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>微软雅黑：<a href="https://pan.baidu.com/s/1pL5asEv">https://pan.baidu.com/s/1pL5asEv</a></li>
<li>放入/usr/share/fonts/my_fonts/中</li>
</ul>
</div>
</div>
