src/02_tech/manjaro_setup.org
* 安装 latex

#+BEGIN_SRC bash
# 安装底层（最后一个用于解决bibtex的问题）
sudo pacman -S texlive-core texlive-langchinese texlive-latexextra texlive-publishers

# 安装IDE
sudo pacman -S texstudio

# 更新texlive
texhash
#+END_SRC

* 双显卡驱动
manjaro装机之后的显卡驱动切换程序：Bumblebee还是有点问题，我们重新安装
** 安装
#+BEGIN_SRC bash
# 依赖
sudo pacman -S virtualgl lib32-virtualgl lib32-primus primus

# 安装双显卡切换程序bumblebee
sudo mhwd -f -i pci video-hybrid-intel-nvidia-bumblebee

# 允许服务
sudo systemctl enable bumblebeed

# 添加用户
sudo gpasswd -a $USER bumblebee
#+END_SRC    

** 防止启动后无法进入图形界面
1. 打开 /etc/default/grub
2. 找到并且改为：GRUB_CMLINE_LINUX_DEFAULT="quiet **acpi_osi=! acpi_osi=Linux acpi_osi=’Windows 2015’ pcie_port_pm=off** resume=..."
3. 运行sudo update-grub，重启

** 测试

#+BEGIN_SRC bash
# 安装测试软件
sudo pacman -S mesa-demos

# 集成显卡性能
glxgears -info

# 独显性能
optirun glxgears -info
# 或者
primusrun glxgears -info
#+END_SRC

之后所有需要用独显允许的程序，前面都要加上optirun或者primusrun允许

#+BEGIN_SRC bash
# 打开nvida面板
optirun -b none nvidia-settings -c :8

# 不依赖Bumblebee来使用CUDA
sudo tee /proc/acpi/bbswitch <<< 'ON'

# 使用完CUDA 停止NVIDIA显卡
sudo rmmod nvidia_uvm nvidia && sudo tee /proc/acpi/bbswitch <<< OFF
#+END_SRC

#+BEGIN_SRC bash
inxi -G # 查看显卡情况

optirun nvidia-smi # 查看CPU情况
#+END_SRC

** 两种用法
1. 用bumblebee切换：
命令前面加上 optirun 或者primusrun运行
2. 用bbswitch:

#+BEGIN_SRC bash
# 一直开启独显
sudo tee /proc/acpi/bbswitch <<< 'ON'
# 一直禁用独显
sudo tee /proc/acpi/bbswitch <<< 'OFF'
#+END_SRC


* docker + pyspark + jupyter 安装

参考： [http://maxmelnick.com/2016/06/04/spark-docker.html](http://maxmelnick.com/2016/06/04/spark-docker.html)
** 本地安装docker

*** 1.1 安装docker包
#+BEGIN_SRC bash
sudo pacman -S docker
#+END_SRC

*** 1.2 防止权限问题，加入用户权限
#+BEGIN_SRC bash
sudo usermod -aG docker ray
#+END_SRC

*** 1.3 重启服务（或者重启计算机）

#+BEGIN_SRC bash
sudo systemctl restart docker
#+END_SRC

*** 1.4 查看安装是否成功
#+BEGIN_SRC bash
sudo docker -info
#+END_SRC

** 配置spark 镜像(images)和容器(containers)

*** 首先，直接建立容器，如果镜像不存在，则会自动下载：

#+BEGIN_SRC
sudo docker run -d -p 8888:8888 --name spark -v $PWD:/home/jovyan/work jupyter/all-spark-notebook start-notebook.sh --NotebookApp.password='sha1:5b1e121347e8:15266c00b25c2e497714de20a674d5b8935e09dd'
#+END_SRC

命令解释：

- docker run 载镜像基础上建立容器
- -d 后台运行
- -p 8888:8888 指定端口
- -- name spark 命名容器
- -v $PWD:/home/jovyan/work 挂载 all-spark-notebook的工作目录到当前目录，使得文件可以在docker内外共享（jovyan是该镜像内置的用户名，不要更改！）
- jupyter/all-spark-notebook 镜像名称，来自[https://hub.docker.com/r/jupyter/all-spark-notebook/](https://hub.docker.com/r/jupyter/all-spark-notebook/)
- start-notebook.sh --NotebookApp.password='sha1:5b1e121347e8:15266c00b25c2e497714de20a674d5b8935e09dd' 指定密码而不是token，密码先得转为hash码（[怎么转](http://jupyter-notebook.readthedocs.io/en/latest/public_server.html#preparing-a-hashed-password)）


在浏览器中输入'http://localhost:8888'，即可打开容器对应的notebook

*** 其次，查看docker状态

#+BEGIN_SRC
# 显示当前容器
docker ps

# 显示所有容器
docker ps -a

# 显示所有镜像 
docker images

# 删除容器
docker rm container_name

# 删除镜像，必须先删除依赖该镜像的容器
docker rmi image_name

#+END_SRC

*** 最后，直接打开或是关闭

#+BEGIN_SRC
# 关闭容器
docker stop spark

# 打开容器
docker start spark

#+END_SRC

** 3 推荐的pyspark docker
- [pyspark-notebook](https://hub.docker.com/r/jupyter/pyspark-notebook/)
- [all-spark-notebook](https://hub.docker.com/r/jupyter/all-spark-notebook/)

# 安装 ZSH

zsh，shell中的极品（[为什么](https://www.zhihu.com/question/21418449)）

** 1. 安装zsh

#+BEGIN_SRC
sudo pacman -S git, zsh
#+END_SRC

** 2. 安装 oh-my-zsh
oh-my-zsh是zsh的一个封装，类似spacemacs和emacs的关系

#+BEGIN_SRC
sh -c "$(curl -fsSL https://raw.github.com/robbyrussell/oh-my-zsh/master/tools/install.sh)"
#+END_SRC

记着将`.bashrc`中添加的语句复制到`.zshrc`中

** 3. 设置为默认shell

#+BEGIN_SRC
chsh -s /bin/zsha
#+END_SRC

** 4. 添加powerline

#+BEGIN_SRC
pip install git+git://github.com/powerline/powerline
#+END_SRC

然后将
#+BEGIN_SRC
powerline-daemon -q
POWERLINE_BASH_CONTINUATION=1
POWERLINE_BASH_SELECT=1
. /usr/local/lib/python2.7/dist-packages/powerline/bindings/zsh/powerline.zsh
#+END_SRC
添加到`.zshrc`中，注意powerline的位置不一定是上面的，需要自行更改

最后重启
* tensorflow 环境搭建

我们的配置是：

- CUDA-8.0
- cuDNN-6
- tensorflow-gpu 1.4

