src/02_tools/manjaro_setup.html

<div id="outline-container-org6929754" class="outline-3">
<h3 id="org6929754"><span class="section-number-3">3.3</span> 建立缓存</h3>
<div class="outline-text-3" id="text-3-3">
<p>
mkfontscale 
mkfontdir 
fc-cache -fv
</p>
</div>
</div>
</div>

<div id="outline-container-orgfe2cb6f" class="outline-2">
<h2 id="orgfe2cb6f"><span class="section-number-2">4</span> 安装 latex</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">&#23433;&#35013;&#24213;&#23618;&#65288;&#26368;&#21518;&#19968;&#20010;&#29992;&#20110;&#35299;&#20915;bibtex&#30340;&#38382;&#39064;&#65289;</span>
sudo pacman -S texlive-core texlive-langchinese texlive-latexextra texlive-publishers

<span class="org-comment-delimiter"># </span><span class="org-comment">&#23433;&#35013;IDE</span>
sudo pacman -S texstudio

<span class="org-comment-delimiter"># </span><span class="org-comment">&#26356;&#26032;texlive</span>
texhash
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee3be24" class="outline-2">
<h2 id="orgee3be24"><span class="section-number-2">5</span> 双显卡驱动</h2>
<div class="outline-text-2" id="text-5">
<p>
manjaro装机之后的显卡驱动切换程序：Bumblebee还是有点问题，我们重新安装
</p>
</div>
<div id="outline-container-org39011de" class="outline-3">
<h3 id="org39011de"><span class="section-number-3">5.1</span> 安装</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">&#20381;&#36182;</span>
sudo pacman -S virtualgl lib32-virtualgl lib32-primus primus

<span class="org-comment-delimiter"># </span><span class="org-comment">&#23433;&#35013;&#21452;&#26174;&#21345;&#20999;&#25442;&#31243;&#24207;bumblebee</span>
sudo mhwd -f -i pci video-hybrid-intel-nvidia-bumblebee

<span class="org-comment-delimiter"># </span><span class="org-comment">&#20801;&#35768;&#26381;&#21153;</span>
sudo systemctl enable bumblebeed

<span class="org-comment-delimiter"># </span><span class="org-comment">&#28155;&#21152;&#29992;&#25143;</span>
sudo gpasswd -a $<span class="org-variable-name">USER</span> bumblebee
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f50bcf" class="outline-3">
<h3 id="org6f50bcf"><span class="section-number-3">5.2</span> 防止启动后无法进入图形界面</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li>打开 /etc/default/grub</li>
<li>找到并且改为：GRUB_CMLINE_LINUX_DEFAULT="quiet <b><b>acpi_osi=! acpi_osi=Linux acpi_osi=’Windows 2015’ pcie_port_pm=off</b></b> resume=&#x2026;"</li>
<li>运行sudo update-grub，重启</li>
</ol>
</div>
</div>

<div id="outline-container-orgcc8f25e" class="outline-3">
<h3 id="orgcc8f25e"><span class="section-number-3">5.3</span> 测试</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">&#23433;&#35013;&#27979;&#35797;&#36719;&#20214;</span>
sudo pacman -S mesa-demos

<span class="org-comment-delimiter"># </span><span class="org-comment">&#38598;&#25104;&#26174;&#21345;&#24615;&#33021;</span>
glxgears -info

<span class="org-comment-delimiter"># </span><span class="org-comment">&#29420;&#26174;&#24615;&#33021;</span>
optirun glxgears -info
<span class="org-comment-delimiter"># </span><span class="org-comment">&#25110;&#32773;</span>
primusrun glxgears -info
</pre>
</div>

<p>
之后所有需要用独显允许的程序，前面都要加上optirun或者primusrun允许
</p>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">&#25171;&#24320;nvida&#38754;&#26495;</span>
optirun -b none nvidia-settings -c :8

<span class="org-comment-delimiter"># </span><span class="org-comment">&#19981;&#20381;&#36182;Bumblebee&#26469;&#20351;&#29992;CUDA</span>
sudo tee /proc/acpi/bbswitch &lt;&lt;&lt; <span class="org-string">'ON'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">&#20351;&#29992;&#23436;CUDA &#20572;&#27490;NVIDIA&#26174;&#21345;</span>
sudo rmmod nvidia_uvm nvidia &amp;&amp; sudo tee /proc/acpi/bbswitch &lt;&lt;&lt; OFF
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">inxi -G <span class="org-comment-delimiter"># </span><span class="org-comment">&#26597;&#30475;&#26174;&#21345;&#24773;&#20917;</span>

optirun nvidia-smi <span class="org-comment-delimiter"># </span><span class="org-comment">&#26597;&#30475;CPU&#24773;&#20917;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfaedf24" class="outline-3">
<h3 id="orgfaedf24"><span class="section-number-3">5.4</span> 两种用法</h3>
<div class="outline-text-3" id="text-5-4">
<ol class="org-ol">
<li>用bumblebee切换：</li>
</ol>
<p>
命令前面加上 optirun 或者primusrun运行
</p>
<ol class="org-ol">
<li>用bbswitch:</li>
</ol>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">&#19968;&#30452;&#24320;&#21551;&#29420;&#26174;</span>
sudo tee /proc/acpi/bbswitch &lt;&lt;&lt; <span class="org-string">'ON'</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#19968;&#30452;&#31105;&#29992;&#29420;&#26174;</span>
sudo tee /proc/acpi/bbswitch &lt;&lt;&lt; <span class="org-string">'OFF'</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org5028fab" class="outline-2">
<h2 id="org5028fab"><span class="section-number-2">6</span> docker + pyspark + jupyter 安装</h2>
<div class="outline-text-2" id="text-6">
<p>
参考： [<a href="http://maxmelnick.com/2016/06/04/spark-docker.html">http://maxmelnick.com/2016/06/04/spark-docker.html</a>](<a href="http://maxmelnick.com/2016/06/04/spark-docker.html">http://maxmelnick.com/2016/06/04/spark-docker.html</a>)
</p>
</div>
<div id="outline-container-org21da67a" class="outline-3">
<h3 id="org21da67a"><span class="section-number-3">6.1</span> 本地安装docker</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orga64865d" class="outline-4">
<h4 id="orga64865d"><span class="section-number-4">6.1.1</span> 1.1 安装docker包</h4>
<div class="outline-text-4" id="text-6-1-1">
<div class="org-src-container">
<pre class="src src-bash">sudo pacman -S docker
</pre>
</div>
</div>
</div>

<div id="outline-container-orga6c7766" class="outline-4">
<h4 id="orga6c7766"><span class="section-number-4">6.1.2</span> 1.2 防止权限问题，加入用户权限</h4>
<div class="outline-text-4" id="text-6-1-2">
<div class="org-src-container">
<pre class="src src-bash">sudo usermod -aG docker ray
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb7e1582" class="outline-4">
<h4 id="orgb7e1582"><span class="section-number-4">6.1.3</span> 1.3 重启服务（或者重启计算机）</h4>
<div class="outline-text-4" id="text-6-1-3">
<div class="org-src-container">
<pre class="src src-bash">sudo systemctl restart docker
</pre>
</div>
</div>
</div>

<div id="outline-container-org88098c6" class="outline-4">
<h4 id="org88098c6"><span class="section-number-4">6.1.4</span> 1.4 查看安装是否成功</h4>
<div class="outline-text-4" id="text-6-1-4">
<div class="org-src-container">
<pre class="src src-bash">sudo docker -info
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3ab4ff1" class="outline-3">
<h3 id="org3ab4ff1"><span class="section-number-3">6.2</span> 配置spark 镜像(images)和容器(containers)</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-orgcf272e0" class="outline-4">
<h4 id="orgcf272e0"><span class="section-number-4">6.2.1</span> 首先，直接建立容器，如果镜像不存在，则会自动下载：</h4>
<div class="outline-text-4" id="text-6-2-1">
<pre class="example">
sudo docker run -d -p 8888:8888 --name spark -v $PWD:/home/jovyan/work jupyter/all-spark-notebook start-notebook.sh --NotebookApp.password='sha1:5b1e121347e8:15266c00b25c2e497714de20a674d5b8935e09dd'
</pre>

<p>
命令解释：
</p>

<ul class="org-ul">
<li>docker run 载镜像基础上建立容器</li>
<li>-d 后台运行</li>
<li>-p 8888:8888 指定端口</li>
<li>&#x2013; name spark 命名容器</li>
<li>-v $PWD:/home/jovyan/work 挂载 all-spark-notebook的工作目录到当前目录，使得文件可以在docker内外共享（jovyan是该镜像内置的用户名，不要更改！）</li>
<li>jupyter/all-spark-notebook 镜像名称，来自[<a href="https://hub.docker.com/r/jupyter/all-spark-notebook/">https://hub.docker.com/r/jupyter/all-spark-notebook/</a>](<a href="https://hub.docker.com/r/jupyter/all-spark-notebook/">https://hub.docker.com/r/jupyter/all-spark-notebook/</a>)</li>
<li>start-notebook.sh &#x2013;NotebookApp.password='sha1:5b1e121347e8:15266c00b25c2e497714de20a674d5b8935e09dd' 指定密码而不是token，密码先得转为hash码（[怎么转](<a href="http://jupyter-notebook.readthedocs.io/en/latest/public_server.html#preparing-a-hashed-password">http://jupyter-notebook.readthedocs.io/en/latest/public_server.html#preparing-a-hashed-password</a>)）</li>
</ul>


<p>
在浏览器中输入'http://localhost:8888'，即可打开容器对应的notebook
</p>
</div>
</div>

<div id="outline-container-org0baa8e8" class="outline-4">
<h4 id="org0baa8e8"><span class="section-number-4">6.2.2</span> 其次，查看docker状态</h4>
<div class="outline-text-4" id="text-6-2-2">
<pre class="example">
# 显示当前容器
docker ps

# 显示所有容器
docker ps -a

# 显示所有镜像 
docker images

# 删除容器
docker rm container_name

# 删除镜像，必须先删除依赖该镜像的容器
docker rmi image_name

</pre>
</div>
</div>

<div id="outline-container-org340cf1c" class="outline-4">
<h4 id="org340cf1c"><span class="section-number-4">6.2.3</span> 最后，直接打开或是关闭</h4>
<div class="outline-text-4" id="text-6-2-3">
<pre class="example">
# 关闭容器
docker stop spark

# 打开容器
docker start spark

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf5f64d" class="outline-3">
<h3 id="orgbf5f64d"><span class="section-number-3">6.3</span> 3 推荐的pyspark docker</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>[pyspark-notebook](<a href="https://hub.docker.com/r/jupyter/pyspark-notebook/">https://hub.docker.com/r/jupyter/pyspark-notebook/</a>)</li>
<li>[all-spark-notebook](<a href="https://hub.docker.com/r/jupyter/all-spark-notebook/">https://hub.docker.com/r/jupyter/all-spark-notebook/</a>)</li>
</ul>

<p>
zsh，shell中的极品（[为什么](<a href="https://www.zhihu.com/question/21418449">https://www.zhihu.com/question/21418449</a>)）
</p>
</div>
</div>

<div id="outline-container-orga9e2cdc" class="outline-3">
<h3 id="orga9e2cdc"><span class="section-number-3">6.4</span> 1. 安装zsh</h3>
<div class="outline-text-3" id="text-6-4">
<pre class="example">
sudo pacman -S git, zsh
</pre>
</div>
</div>

<div id="outline-container-orgfd7f351" class="outline-3">
<h3 id="orgfd7f351"><span class="section-number-3">6.5</span> 2. 安装 oh-my-zsh</h3>
<div class="outline-text-3" id="text-6-5">
<p>
oh-my-zsh是zsh的一个封装，类似spacemacs和emacs的关系
</p>

<pre class="example">
sh -c "$(curl -fsSL https://raw.github.com/robbyrussell/oh-my-zsh/master/tools/install.sh)"
</pre>

<p>
记着将`.bashrc`中添加的语句复制到`.zshrc`中
</p>
</div>
</div>

<div id="outline-container-orgdac9cdc" class="outline-3">
<h3 id="orgdac9cdc"><span class="section-number-3">6.6</span> 3. 设置为默认shell</h3>
<div class="outline-text-3" id="text-6-6">
<pre class="example">
chsh -s /bin/zsha
</pre>
</div>
</div>

<div id="outline-container-org4fc0a64" class="outline-3">
<h3 id="org4fc0a64"><span class="section-number-3">6.7</span> 4. 添加powerline</h3>
<div class="outline-text-3" id="text-6-7">
<pre class="example">
pip install git+git://github.com/powerline/powerline
</pre>

<p>
然后将
</p>
<pre class="example">
powerline-daemon -q
POWERLINE_BASH_CONTINUATION=1
POWERLINE_BASH_SELECT=1
. /usr/local/lib/python2.7/dist-packages/powerline/bindings/zsh/powerline.zsh
</pre>
<p>
添加到`.zshrc`中，注意powerline的位置不一定是上面的，需要自行更改
</p>

<p>
最后重启
</p>
</div>
</div>
</div>
<div id="outline-container-org92301fd" class="outline-2">
<h2 id="org92301fd"><span class="section-number-2">7</span> tensorflow 环境搭建</h2>
<div class="outline-text-2" id="text-7">
<p>
我们的配置是：
</p>

<ul class="org-ul">
<li>CUDA-8.0</li>
<li>cuDNN-6</li>
<li>tensorflow-gpu 1.4</li>
</ul>
</div>
