src/02_tech/manjaro_setup.org
** 1. 双显卡切换为独显

独显必须一直保持开着的状态，才可以稳定运行cuda等程序，我们通过`bbswitch`切换独显

#+BEGIN_SRC bash
sudo tee /proc/acpi/bbswitch <<< ‘ON’
#+END_SRC

注意，如果`nvidia-smi -pm`为1的话上述方法是无效的，必须变为0，即实时切换状态

#+BEGIN_SRC
nvidia-smi -pm 0
#+END_SRC

** 2. 安装CUDA

*** 2.1 yaourt 安装

#+BEGIN_SRC
yaourt -S cuda-8.0
#+END_SRC

如果遇到yaourt报告空间不够，则：

1. 打开`/etc/yaourtrc`
2. 将 `#TMPDIR="/tmp"` 改为`TMPDIR="/home/$USER/tmp"即可`


*** 2.2 加入环境变量

通过安装日志可以发现，yaourt将安装包迁移到了`/opt`中，因此我们在 `.bashrc`或`.zshrc`、以及`/etc/profile`中加入：

#+BEGIN_SRC
export CUDA_HOME=/opt/cuda
export PATH=/opt/cuda/bin:$PATH
export LD_LIBRARY_PATH=/opt/cuda/lib64:$LD_LIBRARY_PATH
#+END_SRC

*** 2.3 验证安装

查看CUDA版本
#+BEGIN_SRC
nvcc -V
#+END_SRC

编译samples，CUDA安装时自带了samples文件夹，进入该文件夹后直接编译（gcc啥的都给你装好了），但是一定记得用sudo，否则报错

#+BEGIN_SRC
cd /opt/cuda/samples

sudo make
#+END_SRC

查看编译结果：

#+BEGIN_SRC
cd bin/x86_64/linux/release

./deviceQuery    # 最后如果返回pass，则通过

./bandwidthTest    # 最后如果返回pass，则通过

reboot            # 最好重启一下
#+END_SRC


恭喜你，到了这一步，CUDA已经顺利安装完成啦！！

** 3. cuDNN安装

cuDNN是nivida提供的深度学习GPU库，在manjaro下非常好安装：

#+BEGIN_SRC
# 先确定独显是开着的
sudo tee /proc/acpi/bbswitch <<< ‘ON’

yaourt -S cudnn6
#+END_SRC

装好之后，将cudnn文件拷贝到cuda中：

#+BEGIN_SRC
sudo cp /opt/cudnn6/include/cudnn.h /opt/cuda/include
sudo cp cudnn6/lib64/libcudnn* /opt/cuda/lib64

# 增加权限
sudo chmod a+r cuda/include/cudnn.h
sudo chmod a+r cuda/include/cudnn.h
#+END_SRC

恭喜，至此你已经完成了准备工作啦！

** 4. 安装tensorflow-gpu版本

为了跟CUDA8兼容，我们安装1.4版本的tensorflow-gpu

#+BEGIN_SRC
pip install tensorflow-gpu==1.4
#+END_SRC

**重启，很关键***

#+BEGIN_SRC
reboot 
#+END_SRC

重启之后，打开ipython，输入命令进行测试：

#+BEGIN_SRC python
import tensorflow as tf
hello = tf.constant('Hello, TensorFlow!')
sess = tf.Session()
#+END_SRC

如果提示中不包含`ERROR`或`FAIL`字样，且包含了你的独显名称，那么就是正确安装了。


最后设置CPU按需求使用，在每次导入tf时：

#+BEGIN_SRC python
# 设置tendorflow对显存使用按需增长。
import tensorflow as tf
config  = tf.ConfigProto()
config.gpu_options.allow_growth = True
session = tf.Session(config=config)
#+END_SRC


** 5. 安装keras

#+BEGIN_SRC
pip install keras
#+END_SRC

keras默认使用tensorflow后端，并且会直接调用其GPU，因此无需做任何改动

* linux备份

** 0. 权限问题

#+BEGIN_SRC
 sudo gedit /etc/rsyncd.conf
#+END_SRC
将其中的
#+BEGIN_SRC
uid = nobody
gid = nobody
#+END_SRC
改为
#+BEGIN_SRC
uid = root 
gid = root
#+END_SRC

**备份结束之后一定要改回来！！**
** 1. 备份
#+BEGIN_SRC
sudo time rsync -Pa / /run/media/ray/Elements/LinuxBackup/2018_05_10 --exclude="/sys/*" --exclude="/proc/*" --exclude="/mnt/*" --exclude="/tmp/*" --exclude="/run/media/*"
#+END_SRC

** 2. 恢复

#+BEGIN_SRC
sudo rsync -Pa /run/media/ray/Elements/LinuxBackup/2018_05_10 /
#+END_SRC

# teamviewer

manjaro的teamviewer有一些问题，pacman装上之后会出现"Not ready,.."的情况，此时应该：

#+BEGIN_SRC
sudo teamviewer --daemon enable
#+END_SRC

再打开teamviewer即可！

* 连接鼠标
** 1. 蓝牙直连

** 2. 有线连接，安装驱动

#+BEGIN_SRC bash
ltunify unpair mouse
ltunify pair
#+END_SRC

# 开机互换 caps和ctrl
** 每次打开终端时互换
在 ~/.bashrc或者~/.zshrc中添加
#+BEGIN_SRC bash
setxkbmap -option ctrl:swapcaps
#+END_SRC

# jupyter notebook 连接远程服务器

** 服务器端：
生成配置文件
#+BEGIN_SRC bash
$ jupyter notebook --generate-config
#+END_SRC

#+BEGIN_SRC python
In [1]: from IPython.lib import passwd

In [2]: passwd()
Enter password: 
Verify password: 
Out[2]: 'sha1:0e422dfccef2:84cfbcbb3ef95872fb8e23be3999c123f862d856' 
#+END_SRC

打开配置文件
#+BEGIN_SRC bash
$vim ~/.jupyter/jupyter_notebook_config.py 
#+END_SRC
修改：
#+BEGIN_SRC python
  c.NotebookApp.ip='*'
  c.NotebookApp.password = u'sha:ce...刚才复制的那个密文'
  c.NotebookApp.open_browser = False
  c.NotebookApp.port =8888 #随便指定一个端口
  c.NotebookApp.allow_remote_access = True
#+END_SRC

打开jupyter notebook

** 本地端
网页输入 http:// ip_address:8888
