src/02_tools/manjaro_setup.html

<div id="outline-container-org42a9d2d" class="outline-3">
<h3 id="org42a9d2d"><span class="section-number-3">7.1</span> 1. 双显卡切换为独显</h3>
<div class="outline-text-3" id="text-7-1">
<p>
独显必须一直保持开着的状态，才可以稳定运行cuda等程序，我们通过`bbswitch`切换独显
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo tee /proc/acpi/bbswitch &lt;&lt;&lt; &#8216;ON&#8217;
</pre>
</div>

<p>
注意，如果`nvidia-smi -pm`为1的话上述方法是无效的，必须变为0，即实时切换状态
</p>

<pre class="example">
nvidia-smi -pm 0
</pre>
</div>
</div>

<div id="outline-container-org8daf68b" class="outline-3">
<h3 id="org8daf68b"><span class="section-number-3">7.2</span> 2. 安装CUDA</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-org6382e70" class="outline-4">
<h4 id="org6382e70"><span class="section-number-4">7.2.1</span> 2.1 yaourt 安装</h4>
<div class="outline-text-4" id="text-7-2-1">
<pre class="example">
yaourt -S cuda-8.0
</pre>

<p>
如果遇到yaourt报告空间不够，则：
</p>

<ol class="org-ol">
<li>打开`/etc/yaourtrc`</li>
<li>将 `#TMPDIR="/tmp"` 改为`TMPDIR="/home/$USER/tmp"即可`</li>
</ol>
</div>
</div>


<div id="outline-container-orgbb131fd" class="outline-4">
<h4 id="orgbb131fd"><span class="section-number-4">7.2.2</span> 2.2 加入环境变量</h4>
<div class="outline-text-4" id="text-7-2-2">
<p>
通过安装日志可以发现，yaourt将安装包迁移到了`/opt`中，因此我们在 `.bashrc`或`.zshrc`、以及`/etc/profile`中加入：
</p>

<pre class="example">
export CUDA_HOME=/opt/cuda
export PATH=/opt/cuda/bin:$PATH
export LD_LIBRARY_PATH=/opt/cuda/lib64:$LD_LIBRARY_PATH
</pre>
</div>
</div>

<div id="outline-container-org01d73a9" class="outline-4">
<h4 id="org01d73a9"><span class="section-number-4">7.2.3</span> 2.3 验证安装</h4>
<div class="outline-text-4" id="text-7-2-3">
<p>
查看CUDA版本
</p>
<pre class="example">
nvcc -V
</pre>

<p>
编译samples，CUDA安装时自带了samples文件夹，进入该文件夹后直接编译（gcc啥的都给你装好了），但是一定记得用sudo，否则报错
</p>

<pre class="example">
cd /opt/cuda/samples

sudo make
</pre>

<p>
查看编译结果：
</p>

<pre class="example">
cd bin/x86_64/linux/release

./deviceQuery    # 最后如果返回pass，则通过

./bandwidthTest    # 最后如果返回pass，则通过

reboot            # 最好重启一下
</pre>


<p>
恭喜你，到了这一步，CUDA已经顺利安装完成啦！！
</p>
</div>
</div>
</div>

<div id="outline-container-org4b9c279" class="outline-3">
<h3 id="org4b9c279"><span class="section-number-3">7.3</span> 3. cuDNN安装</h3>
<div class="outline-text-3" id="text-7-3">
<p>
cuDNN是nivida提供的深度学习GPU库，在manjaro下非常好安装：
</p>

<pre class="example">
# 先确定独显是开着的
sudo tee /proc/acpi/bbswitch &lt;&lt;&lt; ‘ON’

yaourt -S cudnn6
</pre>

<p>
装好之后，将cudnn文件拷贝到cuda中：
</p>

<pre class="example">
sudo cp /opt/cudnn6/include/cudnn.h /opt/cuda/include
sudo cp cudnn6/lib64/libcudnn* /opt/cuda/lib64

# 增加权限
sudo chmod a+r cuda/include/cudnn.h
sudo chmod a+r cuda/include/cudnn.h
</pre>

<p>
恭喜，至此你已经完成了准备工作啦！
</p>
</div>
</div>

<div id="outline-container-org37b1d6f" class="outline-3">
<h3 id="org37b1d6f"><span class="section-number-3">7.4</span> 4. 安装tensorflow-gpu版本</h3>
<div class="outline-text-3" id="text-7-4">
<p>
为了跟CUDA8兼容，我们安装1.4版本的tensorflow-gpu
</p>

<pre class="example">
pip install tensorflow-gpu==1.4
</pre>

<p>
<b><b>重启，很关键*</b></b>
</p>

<pre class="example">
reboot 
</pre>

<p>
重启之后，打开ipython，输入命令进行测试：
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> tensorflow <span class="org-keyword">as</span> tf
<span class="org-variable-name">hello</span> = tf.constant(<span class="org-string">'Hello, TensorFlow!'</span>)
<span class="org-variable-name">sess</span> = tf.Session()
</pre>
</div>

<p>
如果提示中不包含`ERROR`或`FAIL`字样，且包含了你的独显名称，那么就是正确安装了。
</p>


<p>
最后设置CPU按需求使用，在每次导入tf时：
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">&#35774;&#32622;tendorflow&#23545;&#26174;&#23384;&#20351;&#29992;&#25353;&#38656;&#22686;&#38271;&#12290;</span>
<span class="org-keyword">import</span> tensorflow <span class="org-keyword">as</span> tf
<span class="org-variable-name">config</span>  = tf.ConfigProto()
<span class="org-variable-name">config.gpu_options.allow_growth</span> = <span class="org-constant">True</span>
<span class="org-variable-name">session</span> = tf.Session(config=config)
</pre>
</div>
</div>
</div>


<div id="outline-container-org903e04c" class="outline-3">
<h3 id="org903e04c"><span class="section-number-3">7.5</span> 5. 安装keras</h3>
<div class="outline-text-3" id="text-7-5">
<pre class="example">
pip install keras
</pre>

<p>
keras默认使用tensorflow后端，并且会直接调用其GPU，因此无需做任何改动
</p>
</div>
</div>
</div>

<div id="outline-container-org90f2f75" class="outline-2">
<h2 id="org90f2f75"><span class="section-number-2">8</span> linux备份</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org85c1517" class="outline-3">
<h3 id="org85c1517"><span class="section-number-3">8.1</span> 0. 权限问题</h3>
<div class="outline-text-3" id="text-8-1">
<pre class="example">
 sudo gedit /etc/rsyncd.conf
</pre>
<p>
将其中的
</p>
<pre class="example">
uid = nobody
gid = nobody
</pre>
<p>
改为
</p>
<pre class="example">
uid = root 
gid = root
</pre>

<p>
<b><b>备份结束之后一定要改回来！！</b></b>
</p>
</div>
</div>
<div id="outline-container-orgd6fe3cc" class="outline-3">
<h3 id="orgd6fe3cc"><span class="section-number-3">8.2</span> 1. 备份</h3>
<div class="outline-text-3" id="text-8-2">
<pre class="example">
sudo time rsync -Pa / /run/media/ray/Elements/LinuxBackup/2018_05_10 --exclude="/sys/*" --exclude="/proc/*" --exclude="/mnt/*" --exclude="/tmp/*" --exclude="/run/media/*"
</pre>
</div>
</div>

<div id="outline-container-orga28f37f" class="outline-3">
<h3 id="orga28f37f"><span class="section-number-3">8.3</span> 2. 恢复</h3>
<div class="outline-text-3" id="text-8-3">
<pre class="example">
sudo rsync -Pa /run/media/ray/Elements/LinuxBackup/2018_05_10 /
</pre>

<p>
manjaro的teamviewer有一些问题，pacman装上之后会出现"Not ready,.."的情况，此时应该：
</p>

<pre class="example">
sudo teamviewer --daemon enable
</pre>

<p>
再打开teamviewer即可！
</p>
</div>
</div>
</div>

<div id="outline-container-org94e93b9" class="outline-2">
<h2 id="org94e93b9"><span class="section-number-2">9</span> 连接鼠标</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgc34fc55" class="outline-3">
<h3 id="orgc34fc55"><span class="section-number-3">9.1</span> 1. 蓝牙直连</h3>
</div>

<div id="outline-container-orgcc4d278" class="outline-3">
<h3 id="orgcc4d278"><span class="section-number-3">9.2</span> 2. 有线连接，安装驱动</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-bash">ltunify unpair mouse
ltunify pair
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeac5acf" class="outline-3">
<h3 id="orgeac5acf"><span class="section-number-3">9.3</span> 每次打开终端时互换</h3>
<div class="outline-text-3" id="text-9-3">
<p>
在 ~/.bashrc或者~/.zshrc中添加
</p>
<div class="org-src-container">
<pre class="src src-bash">setxkbmap -option ctrl:swapcaps
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdcce190" class="outline-3">
<h3 id="orgdcce190"><span class="section-number-3">9.4</span> 服务器端：</h3>
<div class="outline-text-3" id="text-9-4">
<p>
生成配置文件
</p>
<div class="org-src-container">
<pre class="src src-bash">$ jupyter notebook --generate-config
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">In [1]: <span class="org-keyword">from</span> IPython.lib <span class="org-keyword">import</span> passwd

In [2]: passwd()
Enter password: 
Verify password: 
Out[2]: <span class="org-string">'sha1:0e422dfccef2:84cfbcbb3ef95872fb8e23be3999c123f862d856'</span> 
</pre>
</div>

<p>
打开配置文件
</p>
<div class="org-src-container">
<pre class="src src-bash">$<span class="org-variable-name">vim</span> ~/.jupyter/jupyter_notebook_config.py 
</pre>
</div>
<p>
修改：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">c.NotebookApp.ip</span>=<span class="org-string">'*'</span>
<span class="org-variable-name">c.NotebookApp.password</span> = u<span class="org-string">'sha:ce...&#21018;&#25165;&#22797;&#21046;&#30340;&#37027;&#20010;&#23494;&#25991;'</span>
<span class="org-variable-name">c.NotebookApp.open_browser</span> = <span class="org-constant">False</span>
<span class="org-variable-name">c.NotebookApp.port</span> =8888 <span class="org-comment-delimiter">#</span><span class="org-comment">&#38543;&#20415;&#25351;&#23450;&#19968;&#20010;&#31471;&#21475;</span>
<span class="org-variable-name">c.NotebookApp.allow_remote_access</span> = <span class="org-constant">True</span>
</pre>
</div>

<p>
打开jupyter notebook
</p>
</div>
</div>

<div id="outline-container-org3fce96c" class="outline-3">
<h3 id="org3fce96c"><span class="section-number-3">9.5</span> 本地端</h3>
<div class="outline-text-3" id="text-9-5">
<p>
网页输入 <a href="http://">http://</a> ip_address:8888
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 杨 睿</p>
<p class="date">Created: 2022-12-30 Fri 10:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
